import re
from typing import Final

MAX_EMAIL_LENGTH: Final[int] = 254
MAX_EMAIL_USER_PART_LENGTH: Final[int] = 64
MAX_EMAIL_DOMAIN_PART_LENGTH: Final[int] = MAX_EMAIL_LENGTH - MAX_EMAIL_USER_PART_LENGTH

# Почти RFC 5321
EMAIL_REGEX_RFC5321: Final[re.Pattern[str]] = re.compile(
    r"^"
    # локальная часть: dot-atom или quoted-string
    r"([!#-\'*+\/-9=?A-Z^-~-]+(\.[!#-\'*+\/-9=?A-Z^-~-]+)*"
    r'|"(?:[]!#-[^-~ \t]|(\\[\t -~]))+")'
    r"@"
    # домен: hostname или address-literal
    r"("
    # hostname: метки по 1–63 символов, разделённые точками
    r"[0-9A-Za-z](?:[0-9A-Za-z-]{0,61}[0-9A-Za-z])?"
    r"(?:\.[0-9A-Za-z](?:[0-9A-Za-z-]{0,61}[0-9A-Za-z])?)*"
    r"|"
    # address-literal: [IPv4] или [IPv6:…]
    r"\["
    r"(?:"
    # IPv4
    r"(?:25[0-5]|2[0-4][0-9]|1[0-9]{2}|[1-9]?[0-9])"
    r"(?:\.(?:25[0-5]|2[0-4][0-9]|1[0-9]{2}|[1-9]?[0-9])){3}"
    r"|"
    # IPv6 (полная экспансия всех возможных сокращений)
    r"IPv6:("
    # 6 групп по 16-ричным с двоеточием
    r"(?:[0-9A-Fa-f]{1,4}:){6}"
    r"|::(?:[0-9A-Fa-f]{1,4}:){5}"
    r"|(?:[0-9A-Fa-f]{1,4}:)?::(?:[0-9A-Fa-f]{1,4}:){4}"
    r"|(?:(?:[0-9A-Fa-f]{1,4}:){0,1}[0-9A-Fa-f]{1,4})?::(?:[0-9A-Fa-f]{1,4}:){3}"
    r"|(?:(?:[0-9A-Fa-f]{1,4}:){0,2}[0-9A-Fa-f]{1,4})?::(?:[0-9A-Fa-f]{1,4}:){2}"
    r"|(?:(?:[0-9A-Fa-f]{1,4}:){0,3}[0-9A-Fa-f]{1,4})?::[0-9A-Fa-f]{1,4}:"
    r"|(?:(?:[0-9A-Fa-f]{1,4}:){0,4}[0-9A-Fa-f]{1,4})?::"
    r"(?:[0-9A-Fa-f]{1,4}:(?:[0-9A-Fa-f]{1,4}|[0-9]{1,3}(?:\.[0-9]{1,3}){3}))"
    r"|(?:(?:[0-9A-Fa-f]{1,4}:){0,5}[0-9A-Fa-f]{1,4})?::[0-9A-Fa-f]{1,4}"
    r"|(?:(?:[0-9A-Fa-f]{1,4}:){0,6}[0-9A-Fa-f]{1,4})?::"
    r")"
    r")"
    r"\]"
    r")"
    r"$"
)
